# Install modules by Homebrew.
#
# $ brew tap Homebrew/bundle
# $ brew bundle
#
#
# If failed to install virtualbox,
# check [System Preferences] > [Security & Privacy] > [General],
# and run the command below:
#
# $ brew cask reinstall --force virtualbox
#
# See [Cannot install virtualbox on macOS High Sierra](https://github.com/caskroom/homebrew-cask/issues/39369).

tap "caskroom/cask"
tap "caskroom/versions"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
brew "ansible"
brew "awscli"
brew "carthage"
brew "cookiecutter"
brew "cowsay"
brew "ctags"
brew "curl", args: ["with-nghttp2"], link: true
brew "direnv"
brew "exiftool"
brew "fortune"
brew "git"
brew "git-lfs"
brew "gnupg"
brew "graphviz"
brew "heroku"
brew "htop"
brew "imagemagick"
brew "inetutils"
brew "jq"
brew "mas"
brew "mysql"
brew "nmap"
brew "opencv"
brew "peco"
brew "postgresql"
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "vim"
brew "wget", args: ["with-debug"]
brew "yarn"
cask "alfred"
cask "android-file-transfer"
cask "android-studio"
cask "atom"
cask "charles"
cask "cheatsheet"
cask "clipy"
cask "coteditor"
cask "cyberduck"
cask "dash"
cask "docker"
cask "dropbox"
cask "epic-games"
cask "evernote"
cask "flux"
cask "fritzing"
cask "gimp"
cask "google-backup-and-sync"
cask "google-chrome"
cask "google-chrome-canary"
cask "google-cloud-sdk"
cask "google-japanese-ime"
cask "insomnia"
cask "intellij-idea"
cask "kindle"
cask "macs-fan-control"
cask "mysqlworkbench"
cask "obs"
cask "phpstorm"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklookapk"
cask "quicklook-csv"
cask "quicklook-json"
cask "quip"
cask "sequel-pro"
cask "sketch"
cask "skitch"
cask "slack"
cask "sublime-text"
cask "timemachineeditor"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
mas "Fusion 360", id: 868968810
mas "LINE", id: 539883307
mas "Memory Clean 2", id: 1114591412
mas "Xcode", id: 497799835

