# Install modules by Homebrew.
#
# $ brew tap Homebrew/bundle
# $ brew bundle
#
#
# If failed to install virtualbox,
# check [System Preferences] > [Security & Privacy] > [General],
# and run the command below:
#
# $ brew cask reinstall --force virtualbox
#
# See [Cannot install virtualbox on macOS High Sierra](https://github.com/caskroom/homebrew-cask/issues/39369).

tap "caskroom/cask"
tap "caskroom/versions"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
brew "ansible"
brew "carthage"
brew "cowsay"
brew "ctags"
brew "curl", args: ["with-nghttp2"], link: true
brew "direnv"
brew "fortune"
brew "git"
brew "git-lfs"
brew "gnupg"
brew "graphviz"
brew "heroku"
brew "imagemagick"
brew "jq"
brew "mysql"
brew "nmap"
brew "opencv"
brew "peco"
brew "reattach-to-user-namespace"
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "vim"
brew "wget", args: ["with-debug"]
brew "yarn"
cask "android-studio"
cask "atom"
cask "charles"
cask "cheatsheet"
cask "clipy"
cask "coteditor"
cask "docker"
cask "dropbox"
cask "evernote"
cask "flux"
cask "gimp"
cask "google-backup-and-sync"
cask "google-chrome"
cask "google-chrome-canary"
cask "google-japanese-ime"
cask "insomnia"
cask "intellij-idea"
cask "kindle"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklookapk"
cask "quicklook-csv"
cask "quicklook-json"
cask "quip"
cask "slack"
cask "sublime-text"
cask "vagrant"
cask "virtualbox"

