AmazonWebServices.aws-toolkit-vscode
Chouzz.vscode-better-align
DavidAnson.vscode-markdownlint
dbaeumer.vscode-eslint
donjayamanne.githistory
eamodio.gitlens
EditorConfig.EditorConfig
eriklynd.json-tools
esbenp.prettier-vscode
GitHub.copilot
GitHub.vscode-pull-request-github
goessner.mdmath
golang.Go
jebbs.plantuml
mbessey.vscode-rufo
mitchdenny.ecdc
ms-azuretools.vscode-docker
ms-dotnettools.csharp
ms-python.python
ms-vscode.cpptools
ms-vscode-remote.remote-containers
PKief.material-icon-theme
rebornix.ruby
streetsidesoftware.code-spell-checker
TabNine.tabnine-vscode
tearoom6.s3uploader-vscode
wingrunr21.vscode-ruby
wmaurer.change-case
xdebug.php-debug
xdebug.php-pack
yzhang.markdown-all-in-one
zobo.php-intellisense
