AmazonWebServices.aws-toolkit-vscode
DavidAnson.vscode-markdownlint
dbaeumer.vscode-eslint
donjayamanne.githistory
eamodio.gitlens
EditorConfig.EditorConfig
eriklynd.json-tools
esbenp.prettier-vscode
felixfbecker.php-debug
felixfbecker.php-intellisense
felixfbecker.php-pack
GitHub.copilot
GitHub.vscode-pull-request-github
goessner.mdmath
golang.Go
streetsidesoftware.code-spell-checker
jebbs.plantuml
mitchdenny.ecdc
ms-azuretools.vscode-docker
ms-dotnettools.csharp
ms-python.python
ms-vscode.cpptools
ms-vscode-remote.remote-containers
PKief.material-icon-theme
rebornix.ruby
tearoom6.s3uploader-vscode
wingrunr21.vscode-ruby
wwm.better-align
yzhang.markdown-all-in-one
