AmazonWebServices.aws-toolkit-vscode
BlockceptionLtd.blockceptionvscodeminecraftbedrockdevelopmentextension
Chouzz.vscode-better-align
Cosine.cosine-vscode
darkriszty.markdown-table-prettify
DavidAnson.vscode-markdownlint
dbaeumer.vscode-eslint
destruc7i0n.vscode-bedrock-definitions
donjayamanne.githistory
eamodio.gitlens
EditorConfig.EditorConfig
eriklynd.json-tools
esbenp.prettier-vscode
GitHub.copilot
GitHub.vscode-github-actions
GitHub.vscode-pull-request-github
goessner.mdmath
golang.Go
jebbs.plantuml
mbessey.vscode-rufo
mitchdenny.ecdc
ms-azuretools.vscode-docker
ms-dotnettools.csharp
ms-python.black-formatter
ms-python.python
ms-vscode-remote.remote-containers
ms-vscode.cpptools
ms-vscode.PowerShell
oderwat.indent-rainbow
phind.phind
PKief.material-icon-theme
Shopify.ruby-lsp
streetsidesoftware.code-spell-checker
TabNine.tabnine-vscode
tearoom6.s3uploader-vscode
wmaurer.change-case
xdebug.php-debug
xdebug.php-pack
yzane.markdown-pdf
yzhang.markdown-all-in-one
zobo.php-intellisense
